SWAP2015-master/Practicas/Practica4/resultados/httperf_bal_haproxy.txt
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 64

Total: connections 1000 requests 977 replies 934 test-duration 13.280 s

Connection rate: 75.3 conn/s (13.3 ms/conn, <=575 concurrent connections)
Connection time [ms]: min 26.9 avg 3796.7 max 7654.5 median 4028.5 stddev 1966.9
Connection time [ms]: connect 545.5
Connection length [replies/conn]: 1.000

Request rate: 73.6 req/s (13.6 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 61.6 avg 68.1 max 74.5 stddev 9.2 (2 samples)
Reply time [ms]: response 3242.8 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=934 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.08 system 5.67 (user 0.6% system 42.7% total 43.3%)
Net I/O: 22.9 KB/s (0.2*10^6 bps)

Errors: total 66 client-timo 66 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 57

Total: connections 1000 requests 969 replies 866 test-duration 13.778 s

Connection rate: 72.6 conn/s (13.8 ms/conn, <=585 concurrent connections)
Connection time [ms]: min 82.3 avg 3886.9 max 7918.4 median 3994.5 stddev 2066.8
Connection time [ms]: connect 562.1
Connection length [replies/conn]: 1.000

Request rate: 70.3 req/s (14.2 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 60.0 avg 64.1 max 68.2 stddev 5.8 (2 samples)
Reply time [ms]: response 3303.8 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=866 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.10 system 5.54 (user 0.7% system 40.2% total 40.9%)
Net I/O: 20.7 KB/s (0.2*10^6 bps)

Errors: total 134 client-timo 134 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 65

Total: connections 1000 requests 970 replies 806 test-duration 13.298 s

Connection rate: 75.2 conn/s (13.3 ms/conn, <=568 concurrent connections)
Connection time [ms]: min 150.9 avg 3607.0 max 7864.3 median 3376.5 stddev 2107.1
Connection time [ms]: connect 561.5
Connection length [replies/conn]: 1.000

Request rate: 72.9 req/s (13.7 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 47.6 avg 57.9 max 68.2 stddev 14.5 (2 samples)
Reply time [ms]: response 2974.5 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=806 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.10 system 5.26 (user 0.8% system 39.6% total 40.3%)
Net I/O: 20.3 KB/s (0.2*10^6 bps)

Errors: total 194 client-timo 194 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 57

Total: connections 1000 requests 965 replies 939 test-duration 13.295 s

Connection rate: 75.2 conn/s (13.3 ms/conn, <=588 concurrent connections)
Connection time [ms]: min 38.3 avg 3776.4 max 7852.7 median 4059.5 stddev 1985.9
Connection time [ms]: connect 551.0
Connection length [replies/conn]: 1.000

Request rate: 72.6 req/s (13.8 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 64.0 avg 68.9 max 73.8 stddev 6.9 (2 samples)
Reply time [ms]: response 3213.1 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=939 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.14 system 5.70 (user 1.0% system 42.8% total 43.9%)
Net I/O: 22.9 KB/s (0.2*10^6 bps)

Errors: total 61 client-timo 61 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 86

Total: connections 1000 requests 777 replies 388 test-duration 17.752 s

Connection rate: 56.3 conn/s (17.8 ms/conn, <=687 concurrent connections)
Connection time [ms]: min 51.2 avg 2578.3 max 11873.5 median 2136.5 stddev 2104.2
Connection time [ms]: connect 440.4
Connection length [replies/conn]: 1.000

Request rate: 43.8 req/s (22.8 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 0.0 avg 24.8 max 61.8 stddev 32.7 (3 samples)
Reply time [ms]: response 2440.0 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=388 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.23 system 6.60 (user 1.3% system 37.2% total 38.5%)
Net I/O: 8.5 KB/s (0.1*10^6 bps)

Errors: total 612 client-timo 612 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 327

Total: connections 1000 requests 596 replies 351 test-duration 14.778 s

Connection rate: 67.7 conn/s (14.8 ms/conn, <=948 concurrent connections)
Connection time [ms]: min 4184.9 avg 7137.4 max 9248.2 median 7411.5 stddev 1426.1
Connection time [ms]: connect 1883.1
Connection length [replies/conn]: 1.000

Request rate: 40.3 req/s (24.8 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 7.6 avg 26.9 max 46.2 stddev 27.3 (2 samples)
Reply time [ms]: response 5495.0 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=351 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.21 system 6.24 (user 1.4% system 42.2% total 43.6%)
Net I/O: 8.7 KB/s (0.1*10^6 bps)

Errors: total 649 client-timo 649 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 121

Total: connections 1000 requests 898 replies 774 test-duration 13.366 s

Connection rate: 74.8 conn/s (13.4 ms/conn, <=662 concurrent connections)
Connection time [ms]: min 111.6 avg 4113.6 max 7997.0 median 4427.5 stddev 2071.9
Connection time [ms]: connect 698.1
Connection length [replies/conn]: 1.000

Request rate: 67.2 req/s (14.9 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 46.4 avg 52.1 max 57.9 stddev 8.2 (2 samples)
Reply time [ms]: response 3343.5 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=774 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.12 system 5.44 (user 0.9% system 40.7% total 41.6%)
Net I/O: 19.3 KB/s (0.2*10^6 bps)

Errors: total 226 client-timo 226 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 133

Total: connections 1000 requests 925 replies 854 test-duration 13.727 s

Connection rate: 72.9 conn/s (13.7 ms/conn, <=631 concurrent connections)
Connection time [ms]: min 63.8 avg 4216.8 max 7963.4 median 4550.5 stddev 2046.8
Connection time [ms]: connect 736.7
Connection length [replies/conn]: 1.000

Request rate: 67.4 req/s (14.8 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 50.0 avg 57.2 max 64.4 stddev 10.2 (2 samples)
Reply time [ms]: response 3449.4 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=854 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.10 system 5.28 (user 0.7% system 38.4% total 39.2%)
Net I/O: 20.4 KB/s (0.2*10^6 bps)

Errors: total 146 client-timo 146 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 64

Total: connections 1000 requests 898 replies 576 test-duration 14.503 s

Connection rate: 68.9 conn/s (14.5 ms/conn, <=658 concurrent connections)
Connection time [ms]: min 49.6 avg 3803.4 max 8124.9 median 3702.5 stddev 2304.4
Connection time [ms]: connect 623.7
Connection length [replies/conn]: 1.000

Request rate: 61.9 req/s (16.2 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 36.0 avg 44.7 max 53.4 stddev 12.3 (2 samples)
Reply time [ms]: response 3240.9 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=576 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.13 system 5.96 (user 0.9% system 41.1% total 42.0%)
Net I/O: 14.2 KB/s (0.1*10^6 bps)

Errors: total 424 client-timo 424 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=192.168.1.102 --port=80 --uri=/ --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 73

Total: connections 1000 requests 948 replies 811 test-duration 13.876 s

Connection rate: 72.1 conn/s (13.9 ms/conn, <=617 concurrent connections)
Connection time [ms]: min 148.9 avg 4125.5 max 7977.6 median 4278.5 stddev 2192.8
Connection time [ms]: connect 668.4
Connection length [replies/conn]: 1.000

Request rate: 68.3 req/s (14.6 ms/req)
Request size [B]: 66.0

Reply rate [replies/s]: min 54.2 avg 58.4 max 62.7 stddev 6.0 (2 samples)
Reply time [ms]: response 3407.7 transfer 0.0
Reply size [B]: header 226.0 content 38.0 footer 0.0 (total 264.0)
Reply status: 1xx=0 2xx=811 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.08 system 5.73 (user 0.6% system 41.3% total 41.9%)
Net I/O: 19.5 KB/s (0.2*10^6 bps)

Errors: total 189 client-timo 189 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0